       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 NUMERO1 PIC 999 VALUE 15.
           01 NUMERO2 PIC 999 VALUE 50.
           01 SALUDO PIC XXXX VALUE "Hola".
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY NUMERO1.
           DISPLAY NUMERO2.
           DISPLAY SALUDO.
           STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
